{
  "results": [
    {
      "title": "Senior Engineer UX Designer",
      "company": {
        "display_name": "PradeepIT Consulting Services Pvt Ltd"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-05-15T22:02:13Z",
      "redirect_url": "https://www.adzuna.in/details/5200126307?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: As a Senior UX Designer, you lead advanced UX and product design effortsrefining design systems, improving usability, and ensuring accessibility. You guide junior team members and may hold formal leadership roles. While your core strength is UX, you also leverage skills from visual design, research, strategy, and content. Key Responsibilities: Design & Project Work Collaborate with cross-functional teams: researchers, designers, developers, and PMs. Create compelling, user-centered vi…"
    },
    {
      "title": "HR Recruiter",
      "company": {
        "display_name": "Prodokraft"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:50:07Z",
      "redirect_url": "https://www.adzuna.in/details/5236376583?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: HR Recruiter Intern* *Company: Prodokraft* *Location:* [remote] *About Us:* Prodokraft is a forward-thinking company committed to innovation and excellence. We are currently seeking motivated HR Recruiter Interns to join our dynamic team. If you are passionate about recruitment and eager to gain hands-on experience in a fast-paced environment, we want to hear from you! *Position Overview:* As an HR Recruiter Intern at Prodokraft, you will play a crucial role in identifying and attrac…"
    },
    {
      "title": "Inside Sales Specialist",
      "company": {
        "display_name": "Fashion TV India"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-20T21:31:32Z",
      "redirect_url": "https://www.adzuna.in/details/5260074329?utm_medium=api&utm_source=6fec1d82",
      "description": "Key Responsibilities: Outbound Sales : Proactively generate leads through cold calls, emails, and other outreach methods. You’ll drive sales by identifying opportunities and converting prospects into customers. Tele calling Excellence: Engage with prospective clients and follow up on warm leads to assess their needs, qualify them, and pitch relevant solutions in a professional and persuasive manner. CRM Management: Utilize CRM tools to track and manage sales activities, maintain accurate record…"
    },
    {
      "title": "In_ RBIN_ Mgr. / Senior Manager_Sr. HR Business Partner",
      "company": {
        "display_name": "Bosch Group"
      },
      "location": {
        "display_name": "Jaipur, Rajasthan"
      },
      "created": "2025-07-05T11:02:42Z",
      "redirect_url": "https://www.adzuna.in/details/5286672340?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Build Talent Pipeline ; Draw trajectory with regard to capacity development in line with the business development and build plan for Talent and Talent pipeline Collaborate with the talent acquisition team to support and ensure strategic hiring is in line with the business objective Talent Management And Development; Plan, develop and retain talent for future leadership pipeline by partnering with Business leaders leveraging prevailing tools and platforms Partner with business to…"
    },
    {
      "title": "Workato Integration Analyst",
      "company": {
        "display_name": "Staff4Me"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2024-06-05T19:40:49Z",
      "redirect_url": "https://www.adzuna.in/details/4722634069?utm_medium=api&utm_source=6fec1d82",
      "description": "Staff4Me is currently seeking a skilled and experienced Workato Integration Analyst to join our team. As a Workato Integration Analyst, your main responsibility will be to design, develop, and implement integrations using the Workato platform. You will work closely with cross-functional teams to understand business requirements and translate them into effective integration solutions. Responsibilities Design and develop integrations between various applications and systems using the Workato plat…"
    },
    {
      "title": "Sales Executive",
      "company": {
        "display_name": "ridhira"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-06T20:42:56Z",
      "redirect_url": "https://www.adzuna.in/details/5236363824?utm_medium=api&utm_source=6fec1d82",
      "description": "The candidate for this position will excel at creating and closing new opportunities. By using a consultative approach to selling, this person will use their expertise to identify and qualify leads, leading to sales opportunities with both new and existing customers. Responsibilities Meet and exceed sales targets Successfully create business from new and existing customer accounts Manage complex negotiations with senior-level executives Build rapport and establish long term relationships with c…"
    },
    {
      "title": "Payroll Specialist",
      "company": {
        "display_name": "Esyasoft Technologies Private Limited"
      },
      "location": {
        "display_name": "Agara, Bangalore"
      },
      "created": "2025-06-17T19:06:30Z",
      "redirect_url": "https://www.adzuna.in/details/5254769233?utm_medium=api&utm_source=6fec1d82",
      "description": "We are looking for a detail-oriented and experienced Payroll Specialist to oversee and manage payroll processing and compliance. The ideal candidate should be proficient in end-to-end payroll operations, statutory compliance, and reconciliations. Experience with any Payroll/HRMS tool is required, and familiarity with tools like Zoho Payroll, SAP-HRMS, SAP-FICO, or Tally ERP will be considered a strong advantage. Key Responsibilities: Execute monthly payroll processing for 1000 employees accurat…"
    },
    {
      "title": "Business Development Manager",
      "company": {
        "display_name": "Kezan consulting"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:45:35Z",
      "redirect_url": "https://www.adzuna.in/details/5236366100?utm_medium=api&utm_source=6fec1d82",
      "description": "Business Development Manager Job Description About company- Kezan Consulting- A unit of Kezan India Private Limited, we specialize in providing expert human resource solutions for businesses of all sizes. We believe in people, and we know that they can create amazing, even seemingly impossible, things. People often amaze us with what we are capable of as humans. People push the boundaries to perform unimaginable things. And at Kezan, our expertise is fueling this spark. About the Role: Kezan Co…"
    },
    {
      "title": "Digital marketing manager",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Jaipur, Rajasthan"
      },
      "created": "2025-06-06T20:42:50Z",
      "redirect_url": "https://www.adzuna.in/details/5236363095?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description If you live and breathe digital marketing, we want to talk to you. We are looking for a Digital Marketing Manager to develop, implement, track and optimize our digital marketing campaigns across all digital channels. You should have a strong grasp of current marketing tools and strategies and be able to lead integrated digital marketing campaigns from concept to execution. Digital marketing managers will work with the marketing team, supporting teams (such as programmers), and v…"
    },
    {
      "title": "Customer Success Executive",
      "company": {
        "display_name": "Ithink Logistics"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:42:53Z",
      "redirect_url": "https://www.adzuna.in/details/5236363452?utm_medium=api&utm_source=6fec1d82",
      "description": "Customer Success Executive Is iThink Logistics a Logistics Company? No, we re not. Surprised? Let us tell you a little on what IThink is all about. At IThink, we think about serving only the best for our customers while helping them grow their businesses easily and efficiently. Think of it as us making the whole painful process of delivery and shipment a walk in the park for everyone! Then what exactly is IThink? Here s the answer you re looking for: IThink is a courier aggregator company where…"
    },
    {
      "title": "HRBP",
      "company": {
        "display_name": "E4 HR Associates"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:50:20Z",
      "redirect_url": "https://www.adzuna.in/details/5236377131?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: The HRBP (Human Resources Business Partner) plays a critical role in aligning business objectives with employees and management in designated business units. This role serves as a consultant to management on human resource-related issues, while acting as an employee champion and change agent. The HRBP assesses and anticipates HR-related needs, communicating proactively with the HR department and business management, and seeks to develop integrated solutions. Key Responsibilities: Cons…"
    },
    {
      "title": "Cloud Engineer",
      "company": {
        "display_name": "Techladder"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:45:39Z",
      "redirect_url": "https://www.adzuna.in/details/5236366870?utm_medium=api&utm_source=6fec1d82",
      "description": "Company Overview: PNG Techladder is a leading technology company in the None industry, specializing in cloud solutions. We work with clients from various sectors to provide innovative and efficient cloud-based solutions. Role and Responsibilities: We are currently seeking a Cloud Engineer to join our team. The role will involve: Designing, implementing, and maintaining cloud infrastructure for our clients. Collaborating with cross-functional teams to ensure smooth deployment and operation of cl…"
    },
    {
      "title": "F&B Executive - Pullman Chennai Anna Salai",
      "company": {
        "display_name": "PULLMAN"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-13T22:36:25Z",
      "redirect_url": "https://www.adzuna.in/details/5248880148?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Coordinate and assist in opening/closing duties and ensure that all settings are completed according to standards and procedures prior to the start of operation Assist management to supervise junior team members and casual labor under his/her leadership/section and to ensure that all tasks assigned/required in the outlet are carried out on time and according to instruction and departmental standards Take and record restaurant reservations/cancellations in accordance to departmen…"
    },
    {
      "title": "DevOps Engineer",
      "company": {
        "display_name": "Rystad Energy"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-07-07T12:10:37Z",
      "redirect_url": "https://www.adzuna.in/details/5289805186?utm_medium=api&utm_source=6fec1d82",
      "description": "Rystad Energy is a leading global independent research and energy intelligence company dedicated to helping clients navigate the future of energy. By providing high-quality data and thought leadership, our international team empowers businesses, governments and organizations to make well-informed decisions. Our extensive portfolio of products and solutions covers all aspects of global energy fundamentals, spanning every corner of the oil and gas industry, renewables, clean technologies, supply …"
    },
    {
      "title": "Customer service representative ( US Process )",
      "company": {
        "display_name": "Devdort"
      },
      "location": {
        "display_name": "Ahmedabad, Gujarat"
      },
      "created": "2025-06-06T20:52:19Z",
      "redirect_url": "https://www.adzuna.in/details/5236379396?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview The Customer Service Representative (US Process) plays a vital role in enhancing the customer experience for our company. This position serves as the primary point of contact for customers, ensuring that their needs and inquiries are addressed promptly and effectively. In an ever-evolving marketplace, the significance of excellent customer service cannot be underestimated; it is essential for maintaining customer loyalty and satisfaction. The role demands a blend of effective communica…"
    },
    {
      "title": "Senior Maximo Consultant",
      "company": {
        "display_name": "Talpro India Private Limited"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:45:39Z",
      "redirect_url": "https://www.adzuna.in/details/5236366794?utm_medium=api&utm_source=6fec1d82",
      "description": "Senior Maximo Consultant Cadre: P3 Location: PAN IndiaExperience: 6 to 9 Years Primary Job Responsibility: As a Senior Maximo Consultant, you will play a pivotal role in facilitating the smooth movement of code across various environments, providing critical support and monitoring for live production servers, and assisting the development team with their day-to-day activities. You will collaborate effectively with diverse teams and offshore resources, using your expertise to analyze server and …"
    },
    {
      "title": "Flutter App Developer",
      "company": {
        "display_name": "Flyzy"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:45:44Z",
      "redirect_url": "https://www.adzuna.in/details/5236367803?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: Flutter App Developer Location: Gurgaon (Hybrid) About Us: Welcome to Flyzy, where the sky is not the limit; it's just the beginning! At Flyzy, we're all about making the travel experience unforgettable, and we do it with a touch of whimsy and a dash of innovation. If you're ready to take flight into the world of Flutter app development, hop on board it's going to be a journey like no other! Job Overview: Are you a tech wizard with a flair for making apps as smooth as a first-class f…"
    },
    {
      "title": "Assistant Manager Finance-Trivandrum",
      "company": {
        "display_name": "Talentfleet Solutions Pvt Ltd"
      },
      "location": {
        "display_name": "Kannur, Kerala"
      },
      "created": "2025-06-26T23:21:27Z",
      "redirect_url": "https://www.adzuna.in/details/5269873324?utm_medium=api&utm_source=6fec1d82",
      "description": "Record / process accounting transactions related to Client including: Month close process and record accounting entries and transactions as part of period close activities. Support local regulatory financial reporting and tax requirements Record Intercompany transactions as part of monthly financial reporting / close process Identify and post any GAAP adjustments post agreement with onshore Client Finance teams. Work with onshore Client Finance team to ensure integrity and accuracy of financial…"
    },
    {
      "title": "Director / Vice President",
      "company": {
        "display_name": "Alignity Solutions"
      },
      "location": {
        "display_name": "Hussainialam, Hyderabad"
      },
      "created": "2025-06-26T23:20:54Z",
      "redirect_url": "https://www.adzuna.in/details/5269872966?utm_medium=api&utm_source=6fec1d82",
      "description": "Do you love a career where you Experience , Grow & Contribute at the same time, while earning at least 10% above the market? If so, we are excited to have bumped onto you. Learn how we are redefining the meaning of work , and be a part of the team raved by Clients, Job-seekers and Employees. Jobseeker Video Testimonials Employee Glassdoor Reviews If you are a Talent Acquisition Leader looking for excitement, challenge and stability in your work, then you would be glad to come across this page. …"
    },
    {
      "title": "Manager - Export Transaction - Building Material Industry",
      "company": {
        "display_name": "Consulting Krew Pvt Ltd"
      },
      "location": {
        "display_name": "Delhi, India"
      },
      "created": "2025-06-06T20:50:16Z",
      "redirect_url": "https://www.adzuna.in/details/5236376944?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: The Manager of Export Transactions plays a crucial role in the Building Material Industry company, overseeing the export activities, ensuring compliance with regulations, and contributing to the company's global market expansion. Key Responsibilities: • To support AVP - Accounts in the delivery of corporate tasks and objectives • Provide support in Quarterly LR and Yearly audit documentation. • Align Plant and HO team for preparing details for Income Tax audit/Filing of tax responses.…"
    },
    {
      "title": "Sales Account Executive",
      "company": {
        "display_name": "Premagic"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:45:41Z",
      "redirect_url": "https://www.adzuna.in/details/5236367178?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description. Designation : Accounts Executive – Event. Experience: 2-4 years. Position Overview: We are seeking a highly motivated and experienced Sales Account Executive to join our dynamic team in the event industry. The ideal candidate should have a proven track record of successfully driving sales and building strong relationships with clients in the events sector. As a Sales Account Executive, you will play a crucial role in expanding our client base, meeting sales targets, and contrib…"
    },
    {
      "title": "Software Development Engineer in Test- I",
      "company": {
        "display_name": "Keywords Studios"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-03T17:15:29Z",
      "redirect_url": "https://www.adzuna.in/details/5230499653?utm_medium=api&utm_source=6fec1d82",
      "description": "Helpshift enables companies to provide a modern customer support experience to a mobile consumer base. We are installed on over 2 Billion devices - 1 out of every 3 smartphones in the world - and serve over 900 Million active users every month. Our platform enables 9 Million conversations every month. You will work on projects that impact these conversations in order to bring maximum value to the consumer. Some numbers which illustrate our scale: * 85k/rps * 30ms response time * 300 GB data tra…"
    },
    {
      "title": "Back Office Executive",
      "company": {
        "display_name": "ABS Engineers Ltd"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:42:19Z",
      "redirect_url": "https://www.adzuna.in/details/5236359334?utm_medium=api&utm_source=6fec1d82",
      "description": "Evaluating existing manufacturing processes and identifying areas for improvement. Determining problem resolutions and implementing improvements. Developing detailed layouts for equipment, processes, and workflow. Researching and developing new processes, equipment, and products. Developing and implementing cost-saving measures and quality control systems."
    },
    {
      "title": "SAP GRC",
      "company": {
        "display_name": "Nilasu Consulting Services Pvt Ltd"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:45:45Z",
      "redirect_url": "https://www.adzuna.in/details/5236367933?utm_medium=api&utm_source=6fec1d82",
      "description": "Company Overview: Nilasu Consulting Services Pvt Ltd is a leading human-resources company based in India. Our mission is to deliver exceptional services to our clients, helping them optimize their HR processes and achieve their business goals. Role and Responsibilities: We are currently hiring for the position of SAP GRC. The ideal candidate should have experience in security and GRC implementation projects, as well as HANA experience. Key responsibilities include: End-to-end implementation of …"
    },
    {
      "title": "Test Engineer",
      "company": {
        "display_name": "Sectona"
      },
      "location": {
        "display_name": "Marol Naka, Mumbai"
      },
      "created": "2025-06-11T03:07:26Z",
      "redirect_url": "https://www.adzuna.in/details/5243343225?utm_medium=api&utm_source=6fec1d82",
      "description": "What you will do for Sectona as Test Engineer- Primary Responsibilities As a Test Engineer, you will write code & scripts to test our software for functionality and performance, to aid in our goal of making our product easy & secure for our users. You will do this in dynamic environment where continuous integration is in place and code is actually released every week. You will partner with product engineering team to ensure quality at each step of the SDLC. You will understand priorities and ri…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "Example Corp"
      },
      "location": {
        "display_name": "Mumbai"
      },
      "created": "2025-07-01",
      "redirect_url": "https://example.com/job1",
      "description": "Work with a great team!"
    },
    {
      "title": "Web Developer",
      "company": {
        "display_name": "Sample Ltd"
      },
      "location": {
        "display_name": "Pune"
      },
      "created": "2025-07-02",
      "redirect_url": "https://example.com/job2",
      "description": "Build beautiful websites!"
    }
  ]
}