{
  "results": [
    {
      "title": "Sr. Frontend Engineer",
      "company": {
        "display_name": "AION"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-03T17:15:30Z",
      "redirect_url": "https://www.adzuna.in/details/5230499669?utm_medium=api&utm_source=6fec1d82",
      "description": "About AION: AION is building the next generation of AI cloud platform by transforming the future of high-performance computing (HPC) through its decentralized AI cloud. Purpose-built for bare-metal performance, AION democratizes access to compute power for AI training, fine-tuning, inference, data labeling, and beyond. By leveraging underutilized resources such as idle GPUs and data centers, AION provides a scalable, cost-effective, and sustainable solution tailored for developers, researchers,…"
    },
    {
      "title": "Part-Time Senior Server Administrator",
      "company": {
        "display_name": "M365Connect"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-04-10T21:42:47Z",
      "redirect_url": "https://www.adzuna.in/details/5138953629?utm_medium=api&utm_source=6fec1d82",
      "description": "About Us: At M365Connect, we specialize in connecting elite Microsoft professionals with leading European IT companies. Our commitment to delivering exceptional service and innovative recruitment solutions drives us to excel. Join us in shaping the future of IT recruitment and building strong, professional networks. Job Title: Part-Time Senior Server Administrator Job Description: We are seeking a highly experienced Senior Server Administrator to join our team on a part-time basis (10-15 hours …"
    },
    {
      "title": "MS Dynamics AX (D365 F&O) - Assoc. Lead Consultant",
      "company": {
        "display_name": "Sureminds Solutions"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-06-06T20:45:31Z",
      "redirect_url": "https://www.adzuna.in/details/5236365203?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: Microsoft Dynamics AX 2012 and Dynamics 365 for Finance and Operations Functional Consultant Company Overview: Sureminds Solutions is a leading player in the Staffing and Recruiting industry. Our comprehensive range of services encompass IT consulting, staffing, training, and development. Our clients range from start-ups to established SMEs and Fortune 500 companies. Role and Responsibilities: Have demonstrated experience with Microsoft Dynamics AX 2012 and Dynamics 365 for Finance a…"
    },
    {
      "title": "Export Accountant (jaipur)",
      "company": {
        "display_name": "Naukripay"
      },
      "location": {
        "display_name": "Sanganer, Jaipur"
      },
      "created": "2025-07-03T06:57:17Z",
      "redirect_url": "https://www.adzuna.in/details/5280744372?utm_medium=api&utm_source=6fec1d82",
      "description": "mail:- info@naukripay.com Accountant is a financial professional responsible for managing, analyzing, and reporting a company's financial transactions. Their duties include preparing financial statements, maintaining accurate records, ensuring compliance with accounting principles and regulations, and providing financial advice to management. Key Responsibilities: Financial Reporting: Preparing and presenting financial statements like balance sheets, income statements, and cash flow statements.…"
    },
    {
      "title": "SAP ABAP Developer- TCS -contract",
      "company": {
        "display_name": "Axiom Software Solutions Limited"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-24T20:07:46Z",
      "redirect_url": "https://www.adzuna.in/details/5265825255?utm_medium=api&utm_source=6fec1d82",
      "description": "Axiom Software Solutions Limited is at the forefront of delivering cutting-edge information technology and consulting services worldwide. We are dedicated to helping businesses thrive by providing tailored solutions that drive efficiency and innovation. As we expand our capabilities, we are looking for an experienced SAP ABAP Developer for a contractual role. In this position, you will leverage your technical expertise to develop, enhance, and support SAP applications that meet our clients' spe…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "Element Technologies"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:42:27Z",
      "redirect_url": "https://www.adzuna.in/details/5236360376?utm_medium=api&utm_source=6fec1d82",
      "description": "1) Application development 2) Data Sciences 3) Machine learning. Python developers will play the role of a software developer, data analyst, data scientist, machine learning engineer. Responsibilities: - Writing efficient, reusable, testable, and scalable code Understanding, analyzing, and implementing – Business needs, feature modification requests, conversion into software components Developing – Backend components to enhance performance and receptiveness, server-side logic, and platform, sta…"
    },
    {
      "title": "Linux Kernel Developer with Yocto",
      "company": {
        "display_name": "Vimerse Infotech inc"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:45:51Z",
      "redirect_url": "https://www.adzuna.in/details/5236368606?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description: Linux Developer for Bangalore TNM Company Overview: Vimerse Infotech is an information-technology-and-services company based in Bangalore. We are a team of dedicated professionals who have a passion for making technology work. Role and Responsibilities: The Linux Developer will be responsible for board bring up, BSP development, and Kernel/platform maintenance on Linux/QNX-based devices. The candidate will be required to develop device drivers, triage and fix bugs in Yocto-base…"
    },
    {
      "title": "Marketplace Ads Executive",
      "company": {
        "display_name": "Acme Services Private Limited"
      },
      "location": {
        "display_name": "Bazargate, Mumbai"
      },
      "created": "2025-07-06T02:39:31Z",
      "redirect_url": "https://www.adzuna.in/details/5288156717?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description : Driving sales performance across marketplaces like Amazon, Flipkart Handling paid ad campaigns on Ecommerce Marketplaces. Running platform centric campaigns through various targeting approaches like keyword, products, search etc Monitoring & optimising the performance of promotional campaigns. Expanding presence to newer online marketplaces. Ensuring product presence and sales share on all relevant current & newer platforms Planning product wise and platform wise numbers and d…"
    },
    {
      "title": "AVP of Sales_1",
      "company": {
        "display_name": "Alignity Solutions"
      },
      "location": {
        "display_name": "Kyasaram, Hyderabad"
      },
      "created": "2025-07-03T06:57:02Z",
      "redirect_url": "https://www.adzuna.in/details/5280744016?utm_medium=api&utm_source=6fec1d82",
      "description": "Do you love a career where you Experience , Grow & Contribute at the same time, while earning at least 10% above the market? If so, we are excited to have bumped onto you. Learn how we are redefining the meaning of work , and be a part of the team raved by Clients, Job-seekers and Employees. Jobseeker Video Testimonials Employee Glassdoor Reviews If you are a AVP of Sales Position looking for excitement, challenge and stability in your work, then you would be glad to come across this page. We a…"
    },
    {
      "title": "Front Desk manager",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:42:48Z",
      "redirect_url": "https://www.adzuna.in/details/5236362949?utm_medium=api&utm_source=6fec1d82",
      "description": "Team Player Focused and disciplined Basic knowledge to operate computers, POS, payment machines, etc."
    },
    {
      "title": "Oracle SCM Cloud Consultant",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-06T20:42:33Z",
      "redirect_url": "https://www.adzuna.in/details/5236361103?utm_medium=api&utm_source=6fec1d82",
      "description": "Location: Remote Skills: ï‚· Oracle Cloud SCM Functional Consultant Experience: ï‚· Minimum of 2 years of Oracle Order Management Cloud functional experience Roles & Responsibilities: ï‚· Analyze business processes and help clients transform their business with Oracle. ï‚· Hands-on Oracle Cloud SCM implementation experience. ï‚· Design, prototype and iterate solutions through hands-on configurations in Oracle. ï‚· Understand and apply implementation methodologies to build, document, and test th…"
    },
    {
      "title": "Graphic Designer",
      "company": {
        "display_name": "HRingZa Solutions"
      },
      "location": {
        "display_name": "Rajkot, Gujarat"
      },
      "created": "2025-06-06T20:50:19Z",
      "redirect_url": "https://www.adzuna.in/details/5236377089?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview The Graphic Designer plays a crucial role in our organization by creating visually engaging and innovative graphics for both print and digital media. They are responsible for shaping the visual aspects of websites, product packaging, advertising materials, and more. The Graphic Designer collaborates with the marketing team to ensure that all designs align with the brand's guidelines and effectively communicate the desired message to the audience. Key Responsibilities Create captivating…"
    },
    {
      "title": "TCAT Research Scientist",
      "company": {
        "display_name": "Lifelancer"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-25T22:30:53Z",
      "redirect_url": "https://www.adzuna.in/details/5267762136?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: TCAT Research Scientist (Translation) Job Location: Gurugram, Haryana, India Job Location Type: On-site Job Contract Type: Contract Job Seniority Level: Entry level This post is a 22 Month Fixed Term / Secondment position . As per the Fixed Term Contacts Policy - Where individuals with continuous service within the NHS apply for fixed-term contract roles, NSS reserves the right to refuse any such appointment. About The Organisation National Services Scotland (NSS) is a national NHS B…"
    },
    {
      "title": "Oracle Cloud SCM Functional",
      "company": {
        "display_name": "Mekhalyn Consulting"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:49:21Z",
      "redirect_url": "https://www.adzuna.in/details/5236373397?utm_medium=api&utm_source=6fec1d82",
      "description": "Skill : Oracle Cloud SCM Functional Experience : 2- 10 yrs Associate (2-5 yrs) Senior Associate (5-7) Senior Associate 2 (7-10 yrs) Modules : Order Management , Manufacturing , Planning, Costing Must Have : Cloud End to End implementation Location : Bangalore, Hyderabad, Mumbai, Kolkata, Pune Notice Period : 30-60 Days Virtual drive for Oracle Cloud SCM Functional requirement"
    },
    {
      "title": "Preschool Facilitator",
      "company": {
        "display_name": "Vatatree Consulting"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-13T21:06:25Z",
      "redirect_url": "https://www.adzuna.in/details/5248717959?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: Child Development Expert & Facilitator Location: Sarjarpur Road Employment Type: Full-time Timing: 9 am to 5 pm; 5 days a week with alternate Saturdays working About Us: Innovative learning hub dedicated to fostering child-led, multi-intelligent, and interdisciplinary learning for young children up to Grade 1. We believe in creating a nurturing, experiential, and curiosity-driven environment where children thrive through exploration, creativity, and meaningful connections. We are loo…"
    },
    {
      "title": "Content Writer Intern",
      "company": {
        "display_name": "Ethinos Digital Marketing Private Limited"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-06-06T20:52:04Z",
      "redirect_url": "https://www.adzuna.in/details/5236378682?utm_medium=api&utm_source=6fec1d82",
      "description": "Ethinos has been one of the leading digital marketing agencies in India. We excel in solving new-age problems by developing digital solutions that fit businesses. With over 170 digital specialists across offices in Mumbai, Delhi, and Bangalore, we have partnered with leading brands across verticals to conceptualize and execute data-driven marketing campaigns. Our clientele comprises Niyo, Kotak, Tata Group, IFFCO Tokio, Bharti AXA, Digit, Angel Broking, Motilal Oswal, Reliance Digital, Decathlo…"
    },
    {
      "title": "SAPMM, S4 Hana, Warehouse mngmt, 8 yrs, Minimum 1 implementation Noida/Hyderabad",
      "company": {
        "display_name": "FFTalos Technologies"
      },
      "location": {
        "display_name": "Noida, Ghaziabad"
      },
      "created": "2025-06-06T20:53:14Z",
      "redirect_url": "https://www.adzuna.in/details/5236383288?utm_medium=api&utm_source=6fec1d82",
      "description": "8 - 12yrs exp. Noida or Hyderabad location 5days wfo Immediate to 20days NP. Mandatory Skills: SAPMM, S4 Hana, Ware house management, Minimum 2 implementation. SAP MM-WMS hands on experience • end to end SAP MM implementation project experience with active role • SAP WMS support Project experience Should be instrumental in planning, arranging business workshops, designing and deploying the following SAP & MM business process: • SAP MM / WMS Organization Structure • SAP MM / WMS Master Data • SA…"
    },
    {
      "title": "Executive Assistant to the Director",
      "company": {
        "display_name": "Puro Wellness Pvt. Ltd."
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:42:27Z",
      "redirect_url": "https://www.adzuna.in/details/5236360297?utm_medium=api&utm_source=6fec1d82",
      "description": "We are Hiring for Executive Assistant to the Director Responsibilities · Calendar Management, Travel Management and Guest Management for Director · Scheduling meeting with HODs, follow ups for various pending tasks, getting assignment done. · Taking care of various approval, Meeting minutes, mails, other communications. · Preparing daily and monthly Sales Reports Brand wise to analyze the variance against planned targets. · Co-ordination & partnering with cross-functional stakeholders across th…"
    },
    {
      "title": ".NET Developer- Android",
      "company": {
        "display_name": "Mindera"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2023-07-20T20:42:08Z",
      "redirect_url": "https://www.adzuna.in/details/4215002436?utm_medium=api&utm_source=6fec1d82",
      "description": "Here at Mindera, we are continuously developing a fantastic team, and would love for you to join us. As a Full Stack Software Engineer you’ll be part of the development of the core service-oriented architecture. We’re looking for experienced motivated developers who will be providing solutions in areas of cash depositing system and cash process automations. Developer will be responsible for implementing new requirements as well as customizing and maintaining exiting fertures of the cash deposit…"
    },
    {
      "title": "Graphic Designer",
      "company": {
        "display_name": "Digitals AI Inc"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-30T14:29:07Z",
      "redirect_url": "https://www.adzuna.in/details/5275526518?utm_medium=api&utm_source=6fec1d82",
      "description": "We are seeking a creative and talented Graphic Designer to join our team. The ideal candidate will have a passion for visual communication and a strong understanding of design principles. As a Graphic Designer, you will work closely with marketing, creative, and product teams to create compelling designs that effectively communicate our brand message across various media platforms. Requirements Key Responsibilities: Design Creation & Production: Develop creative concepts, designs, and layouts f…"
    },
    {
      "title": "Planning Analyst",
      "company": {
        "display_name": "Minutes to Seconds Pty Ltd"
      },
      "location": {
        "display_name": "Richmond Town, Bangalore"
      },
      "created": "2025-06-24T21:58:27Z",
      "redirect_url": "https://www.adzuna.in/details/5265916510?utm_medium=api&utm_source=6fec1d82",
      "description": "Minutes To Seconds is a dynamic organization specializing in outsourcing services, digital marketing, IT recruitment, and custom IT projects. We partner with SMEs, mid-sized companies, and niche professionals to deliver tailored solutions. We would love the opportunity to work with YOU Requirements Position /Designation Name:- Sr Planning Analyst Job Location:- Bangalore Choose the relevant job function :- WFM Process Domestic or International :- International Process Experience :- 4 years Noti…"
    },
    {
      "title": "Sitecore Developer",
      "company": {
        "display_name": "Vertis Digital"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-05-28T22:07:26Z",
      "redirect_url": "https://www.adzuna.in/details/5220158927?utm_medium=api&utm_source=6fec1d82",
      "description": "About Us Innovate. Create. Elevate. At Vertis, we are on a mission to constantly innovate and create exceptional digital solutions. Our goal is to elevate our clients brands and the experiences they deliver to their customers through the power of technology-driven creativity. Our people are the catalyst, empowering our clients to successfully transform their businesses - join our team of able, confident, and motivated superstars. About the job We are seeking a skilled Sitecore Developer to join…"
    },
    {
      "title": "Design Engineer (3D CAD)",
      "company": {
        "display_name": "CRA"
      },
      "location": {
        "display_name": "Noida, Ghaziabad"
      },
      "created": "2025-06-25T17:27:21Z",
      "redirect_url": "https://www.adzuna.in/details/5267324468?utm_medium=api&utm_source=6fec1d82",
      "description": "CRA is a purpose-driven engineering firm with over 30 years of experience designing and manufacturing custom-built systems for the Energy and Defence sectors. Our work spans biogas systems, flaring and combustion packages, and complex weapon handling systems — all engineered in-house for durability, reliability, and performance in demanding environments. Role Overview We are seeking a Design Engineer (3D CAD) to join our multidisciplinary engineering team. You’ll be responsible for developing d…"
    },
    {
      "title": "Telemaketing Executive",
      "company": {
        "display_name": "Tayana Solutions"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:45:35Z",
      "redirect_url": "https://www.adzuna.in/details/5236366107?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Type: Fulltime Location : Remote Exp : 2 Years Notice period - Immediate- 15 Days Responsibilities : · Cold call people using a given phone directory to sell products or solicit donations · Answer incoming calls from prospective customers · Use scripts to provide information about product’s features, prices etc. and present their benefits · Ask pertinent questions to understand the customer’s requirements · Persuade the customer to buy by demonstrating how merchandise or services meet their…"
    },
    {
      "title": "Sr.System Software Engineer",
      "company": {
        "display_name": "Intuitive Apps"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-06T20:42:22Z",
      "redirect_url": "https://www.adzuna.in/details/5236359692?utm_medium=api&utm_source=6fec1d82",
      "description": "Hi to all Tech Enthusiasts out there , We are hiring for a reputed IT client of ours for the below positions : Designation: Sr.System Software Engineer Exp: 8 to 20 yrs Notice Period : Immediate Joiner or Max to Max 20 days. Team Handling Exp is must Key Skills: Core Java Java 8 Data Structure Algorithms Design Pattern Data Structure Memory Management Rest API Job Description: • Must have - Core JAVA, Multithreading, OOPS, Multiprocessing, Java 8 features, Collections and REST API • Must have -…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "Example Corp"
      },
      "location": {
        "display_name": "Mumbai"
      },
      "created": "2025-07-01",
      "redirect_url": "https://example.com/job1",
      "description": "Work with a great team!"
    },
    {
      "title": "Web Developer",
      "company": {
        "display_name": "Sample Ltd"
      },
      "location": {
        "display_name": "Pune"
      },
      "created": "2025-07-02",
      "redirect_url": "https://example.com/job2",
      "description": "Build beautiful websites!"
    }
  ]
}