{
  "results": [
    {
      "title": "Solution Architect .Net",
      "company": {
        "display_name": "Tuitions Tree"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-06T20:52:50Z",
      "redirect_url": "https://www.adzuna.in/details/5236381836?utm_medium=api&utm_source=6fec1d82",
      "description": "Solution Architect - .Net Overview The Solutions Architect - .Net plays a critical role in an organization's technology strategy, serving as a bridge between business needs and technological solutions. This role is essential for designing comprehensive software solutions that align with business objectives and improve operational efficiency. The Solution Architect will leverage their expertise in .NET technologies to ensure that the architecture is robust, scalable, and flexible to adapt to fut…"
    },
    {
      "title": "GSA - Food & Beverage",
      "company": {
        "display_name": "AccorHotel"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-07-03T04:56:55Z",
      "redirect_url": "https://www.adzuna.in/details/5280629550?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Perform opening/closing side duties as assigned and set all tables according to standards and procedures Deliver F&B services in accordance to departmental standards and procedures Check on table setting, cleanliness and side station preparation as per work station assigned prior to the start of operation Greet all patrons warmly upon arrival at the door and escort them to the table Ensure that all food & beverage are served according to service standard Apply necessary precauti…"
    },
    {
      "title": "DevOps Lead",
      "company": {
        "display_name": "BtrOpsn Software Pvt Ltd"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:42:54Z",
      "redirect_url": "https://www.adzuna.in/details/5236363605?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Location: Ahemdabad (WFH) Notice Period- Immediate- 30 days) Experience- 5-10 years Relevant experience- 5 years is needed Primary Responsibilities: • A technology Professional who understands software development and can solve IT Operational & Deployment challenges using software engineering tools and processes. This position requires understanding of both Software development (Dev) & Deployment Operations (Ops). • One must Understand the overall business requirements and based…"
    },
    {
      "title": "Verbal Ability Trainer",
      "company": {
        "display_name": "Texas International Education Pvt Ltd"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-06T20:45:42Z",
      "redirect_url": "https://www.adzuna.in/details/5236367437?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description: SAT Faculty Position Overview: We are seeking a dedicated and experienced SAT Faculty member to join our educational institutions team. As an SAT Faculty member, you will play a crucial role in preparing high school1 amp; 2 students for success in the Scholastic Assessment Test SAT, a pivotal exam for college admissions in many countries. Your expertise in testtaking strategies, subject matter, and teaching methodologies will empower students to achieve their best possible scor…"
    },
    {
      "title": "Staff Engineer, CRM-SF-Marketing Cloud",
      "company": {
        "display_name": "Nagarro"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-17T22:41:59Z",
      "redirect_url": "https://www.adzuna.in/details/5254996076?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description REQUIREMENTS: Total experience 7 Years. Hands-on working experience in Salesforce Marketing Cloud. Strong working experience in AmpScript, SQL, HTML/CSS, and Server-Side JavaScript (SSJS). Expertise in Marketing Cloud data models and Contact Builder. Expertise in building responsive, mobile-friendly email templates. Solid understanding of marketing automation and data-driven campaign execution. Experience integrating SFMC with Salesforce CRM and other platforms. Problem-solving …"
    },
    {
      "title": "Java Developer",
      "company": {
        "display_name": "Msquare MS"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:42:48Z",
      "redirect_url": "https://www.adzuna.in/details/5236362961?utm_medium=api&utm_source=6fec1d82",
      "description": "Msquare is an international software development firm based out of Canada. From concept to code, development to deployment, Msquare provides custom IT solutions that accelerate workflows, optimize operations and boost revenues. Whether you're looking to develop a new app for your business or improve your existing software environment, we offer the bespoke software development services you require"
    },
    {
      "title": "Construction Engineer",
      "company": {
        "display_name": "Tanu Garments"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-06T20:43:01Z",
      "redirect_url": "https://www.adzuna.in/details/5236364463?utm_medium=api&utm_source=6fec1d82",
      "description": "Send Your Resume On HR WHatsapp Number 919509079631 ﻿ Managing the planning and design stages of construction projects. Contributing technical expertise to project drawings and designs. Performing cost calculations and preparing financial projections. Preparing work schedules in collaboration with the project manager. Liaising between contractors, subcontractors, vendors, and suppliers. Overseeing construction engineering processes. Performing regular tests on materials and procedures to ensure…"
    },
    {
      "title": "Content Marketing Associate",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Varanasi, Uttar Pradesh"
      },
      "created": "2025-06-06T20:45:33Z",
      "redirect_url": "https://www.adzuna.in/details/5236365679?utm_medium=api&utm_source=6fec1d82",
      "description": "Qualifications • 1 years of experience in social media management, content marketing, etc. Workplace type: On-site As a Content Marketing Associate, you'll manage our online presence across social media handles and websites. You will work closely with digital media agencies for content creation, development of online and offline campaigns, and achievement of target KPIs such as a number of impressions, subscribers, leads, etc. Responsibilities • Design and deploy content in the form of (but not…"
    },
    {
      "title": "Design Manager",
      "company": {
        "display_name": "DAMM India"
      },
      "location": {
        "display_name": "Faridabad, Haryana"
      },
      "created": "2025-06-11T03:07:44Z",
      "redirect_url": "https://www.adzuna.in/details/5243343588?utm_medium=api&utm_source=6fec1d82",
      "description": "Role Objective The incumbent will ensure the Company’s operation such as to provide support to the department head in the planning of site /RF designing. Role Responsibilities 8- 12 yrs of experience required in system level EL design using RF Tools & generating Block diagram, Power Budget,Develop Bill of Material (BOM) and Scope of Work (SOW).validation documents. Responsibility for Design & Engineering activities. The TETRA RF design Engineer responsibilities include initial system design, sy…"
    },
    {
      "title": "Data Engineer",
      "company": {
        "display_name": "Careernet Technologies Pvt Ltd"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:49:07Z",
      "redirect_url": "https://www.adzuna.in/details/5236372537?utm_medium=api&utm_source=6fec1d82",
      "description": "We are looking for a Senior Software Engineer, Ideal candidate would be someone with a passion for Clean Code, Scalable architectures, Test Driven Development and DevOps. Someone who loves getting hands dirty with code and learns everyday. RESPONSIBILITIES Hands on developer/lead to work on data modeling, code, and test iteratively on technical solutions for monitoring and analytics requirements. Coordinates with product and leads development team, leads scrum team/board management. Implement E…"
    },
    {
      "title": "General medicine md dnb Consultant for Bhiwani Haryana location",
      "company": {
        "display_name": "Medico Hub"
      },
      "location": {
        "display_name": "Bhiwani, Haryana"
      },
      "created": "2025-06-06T20:52:46Z",
      "redirect_url": "https://www.adzuna.in/details/5236381487?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview The General Medicine MD DNB Consultant plays a critical role in the healthcare system at our facility in Bhiwani, Haryana. This position is pivotal in delivering high-quality medical care to patients across various demographics. The consultant will be responsible for diagnosing and managing a wide range of illnesses, while also taking a lead role in patient advocacy and healthcare management. Their expertise will not only enhance the health outcomes of patients but also contribute to t…"
    },
    {
      "title": "Manager - Online Hotel Relations",
      "company": {
        "display_name": "Hunarstreet Technologies"
      },
      "location": {
        "display_name": "Andheri, Mumbai"
      },
      "created": "2025-06-06T20:49:33Z",
      "redirect_url": "https://www.adzuna.in/details/5236374703?utm_medium=api&utm_source=6fec1d82",
      "description": "Position: Manager - Online Hotel Relations Job Overview: We are seeking a highly motivated and experienced individual to join our team as a B2B Online Hotel Relations Manager. The successful candidate will be responsible for developing and maintaining strategic partnerships with hotels and accommodation providers to expand our platform's inventory and ensure competitive pricing for our clients. The B2B Online Hotel Portal Relations Manager will play a critical role in negotiating contracts, opt…"
    },
    {
      "title": "Asp.net Developer",
      "company": {
        "display_name": "Hirefaast"
      },
      "location": {
        "display_name": "Rajkot, Gujarat"
      },
      "created": "2025-06-06T20:50:20Z",
      "redirect_url": "https://www.adzuna.in/details/5236377132?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: ASP .NET Developer Openings: 3 Location: Rajkot Working Days: Monday to Friday (5 Days) Working Hours: 10:30 AM - 7:00 PM Salary Range: ₹20,000 - ₹50,000 per month (based on experience) Lunch: Provided by the office Job Description: We are seeking ASP .NET Developers with 1 to 4 years of experience to join our team. The ideal candidates will have a strong foundation in .NET technologies and a passion for building robust web applications. You'll be part of a dynamic environment where …"
    },
    {
      "title": "SAP ABAP WORKFLOW",
      "company": {
        "display_name": "AviinTech Business Solutions"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:53:15Z",
      "redirect_url": "https://www.adzuna.in/details/5236383303?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview The SAP ABAP Workflow Developer plays a crucial role in streamlining and automating business processes through effective workflows in the SAP environment. This position is integral to ensuring the efficient use of SAP data and functionalities, which in turn enhances overall productivity across various departments. By leveraging technical expertise in ABAP programming and workflow management, the developer is responsible for designing, implementing, and maintaining complex workflows tha…"
    },
    {
      "title": "Infor M3 Functional Consultant- Supply Chain Management or Sales Equipment",
      "company": {
        "display_name": "Talent Arabia"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-14T20:48:35Z",
      "redirect_url": "https://www.adzuna.in/details/5250585008?utm_medium=api&utm_source=6fec1d82",
      "description": "We have an urgent requirement for Infor M3 Functional Consultant with expertise in Supply Chain Management or Sales Equipment with our client , Remote location. TA Payroll Salary - 80,000-90000 INR ( non negotiable) if a person is exceptionally good, can go little high Experience 7 years  Remote but the consultant should have the flexibility to work onsite (Jeddah, Saudi Arabia) based on demand. Strong Experience on Infor M3 modules such as Inventory Management, Procurement, Sales Orders, Logis…"
    },
    {
      "title": "Business Development Executive",
      "company": {
        "display_name": "LEUTE PASSEN INDIA PRIVATE LIMITED"
      },
      "location": {
        "display_name": "Delhi, India"
      },
      "created": "2025-06-24T20:58:30Z",
      "redirect_url": "https://www.adzuna.in/details/5265855242?utm_medium=api&utm_source=6fec1d82",
      "description": "Key Responsibilities: Engage with OEM affiliates (sales executives & car evaluators) to onboard them as partners. Identify and onboard new affiliate channels. Explore offline auctions and manage procurement coordination. Schedule and oversee vehicle inspections from various lead sources. Negotiate pricing and finalize procurements post-inspection. Take ownership of inside leads and drive conversions. Ensure end-to-end data compliance for all leads. Requirements: 1-3 years of experience in busin…"
    },
    {
      "title": "Senior IT Software Engineer",
      "company": {
        "display_name": "Palo Alto Networks"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-26T23:03:20Z",
      "redirect_url": "https://www.adzuna.in/details/5269863643?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Your Career This position is responsible for Palo Alto Networks’ (PANW)’s Infrastructure Platform Engineering org to join an innovative and fast-paced team. The ideal candidate will play a critical role in developing and deploying scalable, secure and efficient microservice solutions for Infrastructure. You will work with a team of software developers writing great quality software to create digital visibility and action taking mechanisms for PANW's global infrastructure on clou…"
    },
    {
      "title": "Engineer Costing (Auto Components)",
      "company": {
        "display_name": "Universal Flexibles Pvt. Ltd."
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:46:06Z",
      "redirect_url": "https://www.adzuna.in/details/5236369795?utm_medium=api&utm_source=6fec1d82",
      "description": "Universal Flexibles Pvt Ltd ( part of UNIFLEX Group) is based out of 2C, Dyavasandra Industrial Area, 4th Cross, Whitefield Road, Nallur Halli, Bengaluru 560066, Karnataka, India. UNIFLEX with five manufacturing plants spread across Bangalore, Hosur, Dobaspet ,Pantnagar and Hoshiarpur in India manufactures high grade Hose Assemblies, Tube Assemblies, Fuel Injection Pipes, Hose Fittings, Adapters, Automotive Components and Fabricated Assemblies for the Indian as well as Global markets. We serve …"
    },
    {
      "title": "Analytics and Modeling Analyst",
      "company": {
        "display_name": "Overture Rede"
      },
      "location": {
        "display_name": "Sriniwaspuri, South Delhi"
      },
      "created": "2025-06-11T03:07:49Z",
      "redirect_url": "https://www.adzuna.in/details/5243343727?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Title: Analytics and Modeling Analyst Location: India (Flexible) Experience: 2–5 Years Qualification: Any Graduation Job Summary We’re hiring an Analytics and Modeling Analyst to support B2B sales enablement with actionable insights, custom reporting, and data-driven recommendations that fuel revenue growth. Key Responsibilities Generate insightful sales reports and analytics Customize dashboards for strategic decision-making Track sales opportunities and highlight risks Support sales meeti…"
    },
    {
      "title": "Customer Service Executive",
      "company": {
        "display_name": "Unknown"
      },
      "location": {
        "display_name": "Kolkata, West Bengal"
      },
      "created": "2024-05-10T07:39:08Z",
      "redirect_url": "https://www.adzuna.in/details/4686707338?utm_medium=api&utm_source=6fec1d82",
      "description": "Executive Notice For Private Limited Bank. AXIS BANK (IIOCCCOABB) H.R SEND ME YOUR CV : hr.cs.recruitegmail.com POST – Back Office / Office Executive & Others. Walk-In Interview:- Is Going On. Male Or Female Both Can Apply For This Post. Eligibility Criteria:- Qualification – 102. Or Graduation. Age :- 18 to 29 years Salary: – Minimum 10,500 To 18, 900/-Month Skills - • Good Communication. Benefits Of: • PF • ESI • MEDICALE Hiring Process : – Face to Face Interview IIOCCCOABB ( H.R ) Code Must …"
    },
    {
      "title": "Senior Business Analyst - Research",
      "company": {
        "display_name": "Bean HR Consulting"
      },
      "location": {
        "display_name": "Gurgaon, Haryana"
      },
      "created": "2025-06-06T20:42:16Z",
      "redirect_url": "https://www.adzuna.in/details/5236358967?utm_medium=api&utm_source=6fec1d82",
      "description": "Job description Technical skill set and domain knowledge: • Good understanding of business concepts such as business models, market share, target market and segmentation, growth drivers etc. and ability to apply them across different sectors. • Handling ad-hoc/unstructured client requests through good problem solving and logic testing skills and provide insightful research solutions to clients. • Strong secondary research skills with ability to work on sector profiles, benchmarking, competitive…"
    },
    {
      "title": "Blockchain Developer/ Senior Blockchain Developer",
      "company": {
        "display_name": "webclues infotech"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-06T20:42:16Z",
      "redirect_url": "https://www.adzuna.in/details/5236358943?utm_medium=api&utm_source=6fec1d82",
      "description": "Position: Blockchain Developer/ Senior Blockchain Developer Experience Required: 0.6- 5 years Location: Chennai Interested people can share your profile in chakravarthy@webcluesinfotech.com Experience with Smart contract development tools is a plus. ✔️Strong background in JavaScript, Python & Node JS ✔️Experience in writing programs in scripting languages and deep understanding of its architecture. ✔️Strong understanding of REST/JSON based API development and integration. ✔️Hands-on technical e…"
    },
    {
      "title": "Node.Js developer",
      "company": {
        "display_name": "Dotcod"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:50:18Z",
      "redirect_url": "https://www.adzuna.in/details/5236377010?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: The Node.js Developer plays a key role in developing scalable, high-performance applications, and is essential to the successful delivery and maintenance of various software solutions. This role is crucial in contributing to the overall architecture and development of web platforms, ensuring optimal functionality and seamless user experiences. Key Responsibilities: Developing server-side logic using Node.js Building reusable code and libraries for future use Implementation of security…"
    },
    {
      "title": "SAP Business One Consultant",
      "company": {
        "display_name": "Cloud Counselage Pvt Ltd"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-19T22:22:40Z",
      "redirect_url": "https://www.adzuna.in/details/5258344657?utm_medium=api&utm_source=6fec1d82",
      "description": "TO GET TIMELY UPDATES/NOTIFICATIONS ON JOB/INTERNSHIP OPENINGS, FEEL FREE TO JOIN OUR COMMUNITY (FREE MEMBERSHIPS) @ https://www.industryacademiacommunity.com (5 LAKH MEMBERS FROM 45 COUNTRIES) COMPANY BRIEF: Cloud Counselage Pvt. Ltd. (~,,  on LinkedIn) A $  company in the making,   is an - ' '. Led by  ( Tushar Topale , Subhi Shildhankar & Harshada Topale ) who have delivered projects across  , they are now solving . We are building a '-  ' of    globally through our '' initiative @ https://w…"
    },
    {
      "title": "Freelancing Business Writers - B2B Magazines",
      "company": {
        "display_name": "Retail Jeweller India"
      },
      "location": {
        "display_name": "Hyderabad, Telangana"
      },
      "created": "2025-06-06T20:52:44Z",
      "redirect_url": "https://www.adzuna.in/details/5236381364?utm_medium=api&utm_source=6fec1d82",
      "description": "About Us: We (www.retailjewellerindia.com) are a bi-monthly business magazine for the jewellery and gemstone industry with enormous online and social media presence. Our magazines have been a runaway favorite business magazine of India’s gemstone and jewellery retailers since our debut in 2004. We also organize events such as “ The - Retail Jeweller India Awards ”, India s most prestigious and elite event for jewellery retailers (www.retailjewellerindiaawards.com) and “ The Retail Jeweller Indi…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "Example Corp"
      },
      "location": {
        "display_name": "Mumbai"
      },
      "created": "2025-07-01",
      "redirect_url": "https://example.com/job1",
      "description": "Work with a great team!"
    },
    {
      "title": "Web Developer",
      "company": {
        "display_name": "Sample Ltd"
      },
      "location": {
        "display_name": "Pune"
      },
      "created": "2025-07-02",
      "redirect_url": "https://example.com/job2",
      "description": "Build beautiful websites!"
    }
  ]
}