{
  "results": [
    {
      "title": "Md DNB internal medicine consultant",
      "company": {
        "display_name": "Medico Hub"
      },
      "location": {
        "display_name": "Churu, Rajasthan"
      },
      "created": "2025-06-27T20:58:29Z",
      "redirect_url": "https://www.adzuna.in/details/5271657559?utm_medium=api&utm_source=6fec1d82",
      "description": "MD DNB Internal Medicine Consultant The MD DNB Internal Medicine Consultant plays a pivotal role in our healthcare organization. As a specialist in internal medicine, the consultant is responsible for diagnosing, treating, and managing a wide range of adult diseases and complex medical conditions. This role is critical to ensuring that patients receive comprehensive and holistic care, focusing not only on specific health issues but also on preventive medicine and overall well-being. The consult…"
    },
    {
      "title": "SEO Executive",
      "company": {
        "display_name": "IntellVision"
      },
      "location": {
        "display_name": "New Delhi, Delhi"
      },
      "created": "2025-06-06T20:45:42Z",
      "redirect_url": "https://www.adzuna.in/details/5236367447?utm_medium=api&utm_source=6fec1d82",
      "description": "We are looking for a SEO Executive. As a SEO Executive you'll identify strategies, techniques and tactics to increase the number of visitors to a website and obtain a high-ranking placement in the results page of search engines. Key Responsibilities: Monitor and manage technical SEO On Page SEO such as Keyword research, meta tags, SEO site architecture, internal linking etc. Direct off-page optimization projects (e.g. link-building) Competitor research and analysis Assist the content and blog t…"
    },
    {
      "title": "Assistant / Deputy Manager - QA/QC",
      "company": {
        "display_name": "Sika"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-07-03T04:56:52Z",
      "redirect_url": "https://www.adzuna.in/details/5280629132?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description Duties and Responsibilities: • Responsible for performing and supervising the testing of Epoxy/Concrete/Mortar/Admixture/Flooring/RM and PM as per the specification provided by R&D. • Responsible for performing and supervising the testing of Intermediates and Finished products as per the specification provided by R & D. • Responsible for generating Certificate of Analysis for all the batches produced. • Ensuring and maintaining the QC records pertaining to testing results in Har…"
    },
    {
      "title": "Company Secretary (CS) Intern",
      "company": {
        "display_name": "Indigo Group"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-07-04T22:31:00Z",
      "redirect_url": "https://www.adzuna.in/details/5285525990?utm_medium=api&utm_source=6fec1d82",
      "description": "Designation: CS Intern Company : Indigo Advisory Private Limited The Company Secretary Intern will provide essential support to the Head of Company Secretary in managing corporate governance, legal compliance, and secretarial tasks. This includes organizing board meetings, maintaining statutory records, liaising with external advisors, and assisting with finance-related activities (excluding accounting). Key Responsibilities: Legal & Governance Support: Assist the Company Secretary Head with ma…"
    },
    {
      "title": "Supply chain Engineer / Sr. Supply Chain Engineer",
      "company": {
        "display_name": "Arch Staffing Solution"
      },
      "location": {
        "display_name": "Nellore, Andhra Pradesh"
      },
      "created": "2025-06-06T20:43:03Z",
      "redirect_url": "https://www.adzuna.in/details/5236364616?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Details: Develop New vendors Material code Vendor master in SAP RECORDS Coordination store-purchase-logistic Procurement Desired Candidate Profile 5 to 8 yrs in TOWER sector DME/BE 1. IT SAP 2. Negotiation skill 3. Procurement 4. purchase - store- logistic Knowledge"
    },
    {
      "title": "Junior Client Solutions Executive",
      "company": {
        "display_name": "Krea eKnowledge Pvt Ltd"
      },
      "location": {
        "display_name": "Kasturibai Nagar, Chennai"
      },
      "created": "2025-07-02T10:44:05Z",
      "redirect_url": "https://www.adzuna.in/details/5279153132?utm_medium=api&utm_source=6fec1d82",
      "description": "At Krea, we’re looking for a Client Solutions Executive who will support client growth by managing bids, developing proposals, and working closely with internal teams to ensure feasibility, competitive pricing, and on-time delivery. You will also play a key role in nurturing long-term client relationships. Key Responsibilities Bid Management & Proposal Development: ❖ Manage the bid process, ensuring timely responses and accurate documentation in the MR system ❖ Develop proposals by working with…"
    },
    {
      "title": "Full-Stack Developer",
      "company": {
        "display_name": "Fashion TV India"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:45:34Z",
      "redirect_url": "https://www.adzuna.in/details/5236365778?utm_medium=api&utm_source=6fec1d82",
      "description": "As a full-stack developer working with PHP frameworks like CodeIgniter 3 and Laravel (latest version), along with MySQL and front-end technologies like HTML, CSS, SCSS, and JavaScript, your key responsibilities would typically include: Designing and developing scalable and secure web applications using PHP frameworks. Building the back-end logic, including database integration, API development, and server-side scripting. Implementing front-end features using HTML, CSS, SCSS, and JavaScript/jQue…"
    },
    {
      "title": "QA Lead (Manual | Onsite)",
      "company": {
        "display_name": "Testvox"
      },
      "location": {
        "display_name": "Kochi, Ernakulam"
      },
      "created": "2025-07-04T02:58:43Z",
      "redirect_url": "https://www.adzuna.in/details/5282512420?utm_medium=api&utm_source=6fec1d82",
      "description": "QA Lead – Manual Testing (Finance/Banking Domain) Location: Kerala (Initial 3 months in Kollam, then shift to Ernakulam) Employment Type: Full-Time | Permanent Availability: Immediate Joiners (Idle candidates preferred) Job Overview: We are seeking a proactive and experienced QA Lead to manage the end-to-end quality assurance process. The ideal candidate should have strong expertise in manual testing, team leadership, and a deep understanding of QA lifecycle activities, especially in finance or…"
    },
    {
      "title": "Salesforce Developer",
      "company": {
        "display_name": "JSG Consulting Pvt Ltd."
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-26T20:51:17Z",
      "redirect_url": "https://www.adzuna.in/details/5269682526?utm_medium=api&utm_source=6fec1d82",
      "description": "This role is not for India's location. Please apply only if you are willing to apply for the H1B visa (USA) application for 2025 Responsibilities Responsibilities Salesforce Development: Develop and implement customized Salesforce solutions. Build and modify Salesforce objects, workflows, and automation tools. .\"Looking for a skilled Salesforce Developer with 2-3 years of experience in designing, coding, and implementing Salesforce solutions. Must have expertise in Apex, Visualforce, and Salesf…"
    },
    {
      "title": "MEAN stack / Full stack developer",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-06T20:42:36Z",
      "redirect_url": "https://www.adzuna.in/details/5236361528?utm_medium=api&utm_source=6fec1d82",
      "description": "Software Engineer/Junior Developer/IT-Analyst/Senior Developer Skills Required : Angular NodeJs ExpressJs HTML JS CSS NoSql - MongoDB RDBMS - MariaDB/MySql REST APIs"
    },
    {
      "title": "Lead - Analytics",
      "company": {
        "display_name": "Allen Digital"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:42:54Z",
      "redirect_url": "https://www.adzuna.in/details/5236363647?utm_medium=api&utm_source=6fec1d82",
      "description": "About Us After dominating the offline market of ‘Tutoring’, Allen Careers has set out to build the next big thing to happen to ‘Education’. Allen Digital aims to build an EdTech platform to provide students with everything that a classroom cannot. Allen Digital was created as a strategic partnership between Allen Careers Institute and Bodhi Tree Systems to ensure tech enablement for millions of students. We are backed by some of the best names in – media, business, education, and technology. Th…"
    },
    {
      "title": "Project Engineer - 30796",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "Udaipur, Rajasthan"
      },
      "created": "2025-06-06T20:49:30Z",
      "redirect_url": "https://www.adzuna.in/details/5236374211?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: The Project Engineer plays a critical role within the organization, responsible for overseeing and managing engineering projects from conception to completion. This position is vital in ensuring the successful execution of projects, meeting technical specifications, and adhering to deadlines while maintaining high-quality standards. Key Responsibilities: Coordinate engineering projects and ensure all aspects are aligned with the project goals Develop project scopes, timelines, and bud…"
    },
    {
      "title": "Social Media Manager",
      "company": {
        "display_name": "Richestsoft"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:46:14Z",
      "redirect_url": "https://www.adzuna.in/details/5236370475?utm_medium=api&utm_source=6fec1d82",
      "description": "Role Description This is a full-time on-site role for a Social Media Manager. The Social Media Manager will be responsible for developing and implementing social media marketing strategies, creating and executing content calendars, conducting social media optimization (SMO), writing and editing copy for social media posts and ads, and analyzing data to measure the effectiveness of social media campaigns. Qualifications Social Media Marketing, Content Strategy, and Communication skills Experienc…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "PENTOZ Technology"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-14T01:43:38Z",
      "redirect_url": "https://www.adzuna.in/details/5249372952?utm_medium=api&utm_source=6fec1d82",
      "description": "This is a remote position. Job Title: Python Developer Location: Remote Department: Technology Type: Full-Time About Us Inspired by Pentagon USA. Powered by People. Pentoz is a visionary Indian company building a multi-industry innovation powerhouse. From IT services to hospitality and fintech, we’re on a mission to generate 100,000 tech jobs and reshape industries through automation, talent, and public funding. The Opportunity: We’re looking for a talented Python Developer who can design, deve…"
    },
    {
      "title": "Digital Marketing Manager - Ops",
      "company": {
        "display_name": "Digisec technologies"
      },
      "location": {
        "display_name": "Mumbai, Maharashtra"
      },
      "created": "2025-06-06T20:46:17Z",
      "redirect_url": "https://www.adzuna.in/details/5236370741?utm_medium=api&utm_source=6fec1d82",
      "description": "Location – Kandivali West Office Timings – 7:00 am to 4:00 pm Responsibilities: Operational Oversight: Develop and implement effective operational policies and procedures. Monitor and optimize internal processes to enhance efficiency and productivity. Collaborate with department heads to ensure seamless coordination between teams. Team Management: Lead and motivate cross-functional teams to achieve organizational goals. Foster a positive work environment that encourages innovation and collabora…"
    },
    {
      "title": "Full Stack Developer (React Js Node Js)",
      "company": {
        "display_name": "Eazy"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:52:58Z",
      "redirect_url": "https://www.adzuna.in/details/5236382367?utm_medium=api&utm_source=6fec1d82",
      "description": "Key Responsibilities 1. *Design and Development*: Design and develop scalable, efficient, and reliable web applications using (link unavailable), React JS, and other relevant technologies. 2. *Front-end Development*: Develop reusable UI components using React JS, HTML5, CSS3, and JavaScript. 3. *Back-end Development*: Design and develop RESTful APIs using (link unavailable) Core, Web API, and Entity Framework. 4. *Database Management*: Design, develop, and manage databases using SQL Server, MyS…"
    },
    {
      "title": "SAP ABAP CONSULTANT WITH WORKFLOW",
      "company": {
        "display_name": "AviinTech Business Solutions"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:51:55Z",
      "redirect_url": "https://www.adzuna.in/details/5236378359?utm_medium=api&utm_source=6fec1d82",
      "description": "Overview: The SAP ABAP Consultant with Workflow plays a crucial role in designing, developing, and implementing SAP solutions using ABAP programming language with a focus on workflow. This position is vital in ensuring the smooth functioning and customization of SAP systems to meet business requirements and enhance operational efficiency. Key Responsibilities: Collaborate with stakeholders to understand business needs and translate them into technical requirements Design, develop, and maintain …"
    },
    {
      "title": "Business Development Excutive",
      "company": {
        "display_name": "Richestsoft"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:46:15Z",
      "redirect_url": "https://www.adzuna.in/details/5236370550?utm_medium=api&utm_source=6fec1d82",
      "description": "Job description (for experience):- *Only those with experience in direct sales or Online bidding Portals like Upwork, Guru, Pph, and Freelance. *Work on the International Leads for Custom Software Development for Web and Mobile applications. *Create relevant pitches for various industries and solutions and Pitch different clients in a relevant manner. *Lead Nurturing through various Lead Dispositions, Negotiation, and Lead closures. Work from office only. We are looking for an immediate joiner.…"
    },
    {
      "title": "Sr Engineer-Device driver development-BSP/ Linux",
      "company": {
        "display_name": "D Recruitment Company"
      },
      "location": {
        "display_name": "Chennai, Tamil Nadu"
      },
      "created": "2025-06-06T20:42:24Z",
      "redirect_url": "https://www.adzuna.in/details/5236359931?utm_medium=api&utm_source=6fec1d82",
      "description": "Design, develop and unit testing of Embedded OS device driver / Linux device drivers Education BE/BTech/MTech in Computer Science or in Electronics preferred with proven success in a challenging academic program. Job Responsibilities Design, develop, unit test and documentation of the device driver for ARM SoC. Bring up the driver and unit test the driver features in the new ARM SOC. Optimize the driver for maximum performance. Bug analysis/fixing of the issues during product verification stage…"
    },
    {
      "title": "IT Sales Executive",
      "company": {
        "display_name": "Zigsaw"
      },
      "location": {
        "display_name": "India"
      },
      "created": "2025-06-06T20:42:39Z",
      "redirect_url": "https://www.adzuna.in/details/5236361967?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Description 1. Promotes and source customize IT management software and services. 2. Set up meetings with CXO's and decision makers (brand manager, marketing manager, CXO's, IT Manager, head of social media etc.) 3. Sent proposals, brochure and Quotation for acquiring new clients. 4. Direct meetings with the clients and doing start to end sales. (Including pricing Negotiation) 5. Identify and grow relationships with media agencies and brands. 6. Maintain and follow up sales pipeline. 7. Del…"
    },
    {
      "title": "Electrical Engineer - Fresher",
      "company": {
        "display_name": "Telamon HR Solutions"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:52:29Z",
      "redirect_url": "https://www.adzuna.in/details/5236380109?utm_medium=api&utm_source=6fec1d82",
      "description": "Tips: Provide a summary of the role, what success in the position looks like, and how this role fits into the organization overall. Responsibilities Job Title: PLC Engineer Key Responsibilities: PLC Programming and Development : Design, write, and test PLC programs to meet the requirements of the automation systems. Modify existing PLC programs based on process changes, upgrades, and troubleshooting. Ensure programs are optimized for safety, efficiency, and minimal downtime. System Integration …"
    },
    {
      "title": "Selenium, 6 Yrs, Pune",
      "company": {
        "display_name": "2coms"
      },
      "location": {
        "display_name": "Yerwada, Pune"
      },
      "created": "2025-06-19T21:30:23Z",
      "redirect_url": "https://www.adzuna.in/details/5258274273?utm_medium=api&utm_source=6fec1d82",
      "description": "Quality Engineer- Selenium Location- Pune (Onsite) Experience Range- 6 years Notice Period- Immediate Joiners As a Quality Engineer, you will play a key role in enabling full stack solutions through multi-disciplinary team planning and ecosystem integration to accelerate delivery and drive quality across the application lifecycle. Your responsibilities will include performing continuous testing for security, API, and regression suites, creating automation strategies, and supporting data and env…"
    },
    {
      "title": "QA Engineer",
      "company": {
        "display_name": "Aisthetic"
      },
      "location": {
        "display_name": "Bangalore, Karnataka"
      },
      "created": "2025-06-06T20:49:52Z",
      "redirect_url": "https://www.adzuna.in/details/5236375990?utm_medium=api&utm_source=6fec1d82",
      "description": "About the Company: We're a leading global technology consulting agency empowering businesses to reach their pinnacle. Our comprehensive suite of technology services includes: User Interface and Experience Design System Design Website & App Development Omni Commerce Strategy Cloud and Infrastructure Services Technology Team Augmentation Company Insight: We specialize in crafting modern technology platforms that transcend boundaries. At the intersection of design and technology, we redefine possi…"
    },
    {
      "title": "Assistant Quality Check & PDI Engineer - Robotics Machines",
      "company": {
        "display_name": "Peppermint Robotics"
      },
      "location": {
        "display_name": "Pune, Maharashtra"
      },
      "created": "2025-06-11T21:16:30Z",
      "redirect_url": "https://www.adzuna.in/details/5244703366?utm_medium=api&utm_source=6fec1d82",
      "description": "Job Summary: We are looking for a skilled Assistant QC & PDI (Pre-Delivery Inspection) Engineer to join our team. The ideal candidate will have a minimum of 2 years of experience in quality control and pre-delivery inspection within the automobile, robotics or automation industry. This role involves ensuring the quality, functionality, and reliability of robotic machines before delivery to customers. Key Responsibilities: ● Conduct quality control (QC) inspections on robotic machines to ensure …"
    },
    {
      "title": "Oral Surgeon For Dental Hospital Dausa Rajasthan location",
      "company": {
        "display_name": "Medico Hub"
      },
      "location": {
        "display_name": "Dausa, Rajasthan"
      },
      "created": "2025-06-24T20:58:31Z",
      "redirect_url": "https://www.adzuna.in/details/5265855266?utm_medium=api&utm_source=6fec1d82",
      "description": "Oral Surgeon Overview The Oral Surgeon plays a pivotal role in our Dental Hospital in Dausa, Rajasthan, specializing in diagnosing and treating complex dental and oral conditions. With a focus on surgical procedures, this position is critical for managing patients requiring advanced surgical interventions, including tooth extractions, jaw reconstruction, and the treatment of impacted teeth. The Oral Surgeon will work collaboratively with a multidisciplinary team of dental professionals to ensur…"
    },
    {
      "title": "Python Developer",
      "company": {
        "display_name": "Example Corp"
      },
      "location": {
        "display_name": "Mumbai"
      },
      "created": "2025-07-01",
      "redirect_url": "https://example.com/job1",
      "description": "Work with a great team!"
    },
    {
      "title": "Web Developer",
      "company": {
        "display_name": "Sample Ltd"
      },
      "location": {
        "display_name": "Pune"
      },
      "created": "2025-07-02",
      "redirect_url": "https://example.com/job2",
      "description": "Build beautiful websites!"
    }
  ]
}